app/controllers/flights_controller.rb

INSERT INTO "flights" ("flight_num", "origin", "destination", "airplane_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @flight = Flight.new(flight_params)

    respond_to do |format|
      if @flight.save

UPDATE "flights" SET "airplanes_id" = ?, "updated_at" = ? WHERE "flights"."id" = ?  [["airplanes_id", 777], ["updated_at", "2016-10-26 20:35:44.839187"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @flight.update(flight_params)