app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Meggan"], ["created_at", "2016-10-26 01:06:03.753485"], ["updated_at", "2016-10-26 01:06:03.753485"]]